{
  "intents": [
      {
          "tag": "greeting",
          "keywords": [
              "Hi",
              "Hey",
              "How are you",
              "How are you doing",
              "Is anyone there?",
              "What's up?",
              "Hello",
              "Good day",
              "What's popping",
              "What's good"
          ],
          "responses": [
              "Hey! Welcome to Serene.",
              "Hi there, I'm doing well! My name's Serene, what can I do for you?",
              "Hey there, my name's Serene, your mental health friend. How can I help you today?"
          ]
      },

      {   "tag": "goodbye",
          "keywords": [
              "Bye",
              "See you later!",
              "Goodbye!",
              "Thank you"],
          "responses": [
              "See you later! Take care!",
              "Have a lovely day! Take care and stay safe!",
              "Take care of yourself! I'm always here to support you! Feel free to come back at any time!"
          ]
      },

      {   "tag": "thanks",
          "keywords": [
              "Thanks",
              "Thank you",
              "That's helpful",
              "Thanks a lot!",
              "Thank you so much"],
          "responses": [
              "Happy to help!",
              "Any time!",
              "My pleasure"]
      },

      {   "tag": "about",
          "keywords": [
              "What do you do?",
              "Who are you?",
              "What are you here for?",
              "What can you help me with?",
              "Is anyone there?",
              "Are you a real person?",
              "Tell me about yourself!"
          ],
          "responses": [
              "Love that question! My name's Serene, your mental health friend! I've been trained to support you through any of the issues and things that you're going through in life right now.",
              "I'm all ears and want to support you through your ups and downs. Technically, I'm a computer that's been trained by a human, but I like to think of myself as human!",
              "I'm Serene, and my job is to be your mental health friend and support you! My fellow human friends have trained me to be a compassionate listener and supporting bud."
          ]
      },

      {   "tag": "funny",
          "keywords": [
              "Tell me a joke!",
              "Tell me something funny!",
              "Do you know a joke?"
          ],
          "responses": [
              "Of course! Why did the hipster burn his mouth? He drank the coffee before it was cool.",
              "What did the buffalo say when his son left for college? Bison!",
              "I invented a new word! Plagiarism!"
          ]
      },

      {   "tag": "anxiety",
          "keywords": [
              "I think I have anxiety",
              "What is anxiety?",
              "Tell me about anxiety",
              "Can I have some information about anxiety?",
              "How do I support a loved one with anxiety?",
              "How do I fix my anxiety?"
          ],
          "responses": [
              "I see that you want to learn more about anxiety, and how to support yourself or your loved ones.",
              "Anxiety is your body's natural response to stress. It's a feeling of fear or apprehension about what's to come.",
              "Anxiety becomes a problem when it starts affecting your daily life drastically. To help reduce anxiety, take a few deep breaths and talk to someone about how you're feeling.",
              "You can try getting enough sleep, meditating, and exercising.",
              "Maintaining a routine will help you.",
              "Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid."
          ]
      },

      {   "tag": "depression",
          "keywords": [
              "I think I have depression",
              "What is depression?",
              "Tell me about depression",
              "Can I have some information about depression?",
              "How do I support a loved one with depression?",
              "How do I fix my depression?"
          ],
          "responses": [
              "I see that you want to learn more about depression, and how to support yourself or your loved ones.",
              "At the highest level, depression is a mood disorder that causes a persistent feeling of sadness and loss of interest.",
              "Depression affects how you feel, think and behave and can lead to a variety of emotional and physical problems.",
              "You may have trouble doing normal day-to-day activities, and sometimes you may feel as if life isn't worth living, but it's okay.",
              "All of us experience sadness and periods of time where things aren't that great.",
              "The difference in sadness and depression lies in the duration and magnitude of the problem.",
              "The best recommended course of treatment is to talk a therapist or psychiatrist who can help you find the best path for you.",
              "Know that everyone is different and what might work for one person might not work for another one.",
              "You can try some natural remedies like getting enough sleep, meditating, staying active and exercising.",
              "Try eating a healthy diet, staying active and working out, avoiding alcohol and caffeine."
          ]
      },

      {   "tag": "schizophrenia",
          "keywords": [
              "I think I have schizophrenia",
              "What is schizophrenia?",
              "Tell me about schizophrenia",
              "Can I have some information about schizophrenia?",
              "How do I support a loved one with schizophrenia?",
              "How do I fix my schizophrenia?"
          ],
          "responses": [
              "I see that you want to learn more about schizophrenia, and how to support yourself or your loved ones.",
              "At the highest level, Schizophrenia is a serious mental disorder in which people interpret reality abnormally.",
              "Schizophrenia may cause hallucinations, delusions, and extremely disordered thinking and behavior that impairs daily functioning.",
              "People with schizophrenia often require lifelong treatment.",
              "Early treatment may help get symptoms under control before serious complications develop and may help improve the long-term outlook.",
              "If you believe you have symptoms of schizophrenia, consult a family doctor and/or psychiatrist for a diagnosis and treatment plan specific for the individual."
          ]
      },

      {   "tag": "obsessive",
          "keywords": [
              "I'm obsessive",
              "I think I have OCD",
              "I keep having intrusive thoughts",
              "What can I do to stop my intrusive thoughts?",
              "I feel like something bad will happen",
              "How can I face my fears?",
              "I feel like I can't tell anyone about my OCD",
              "Can you help me talk about my OCD?",
              "I'm feeling overwhelmed and stressed because of my OCD"
          ],
          "responses": [
              "I understand that your obsessive thoughts and compulsive behaviors can be very distressing. You are not alone, and there is help available.",
              "It's important to remember that OCD thoughts and urges are just that – thoughts and urges.",
              "Your OCD thoughts do not define you and do not have to control your actions.",
              "Don't worry, your doctor or a mental health professional can help you find the right treatment for you.",
              "Try to engage in activities that bring you joy and relaxation.",
              "Remember to be kind and compassionate to yourself. You are doing the best you can and making progress every day."
          ]
      },

      {   "tag": "substance addiction",
          "keywords": [
              "I can't stop using substances, what can I do to get help?",
              "I've tried to quit before, but I always end up going back to the substance.",
              "How can I stay sober?",
              "I feel ashamed and embarrassed about my addiction.",
              "How can I not rely on substances?",
              "What can I do to cope with these feelings?"

          ],
          "responses": [
              "I understand that you're struggling with substance addiction and it can be a difficult road to recovery. You are not alone, and there is help available.",
              "It's important to remember that substance addiction is a disease and it's not your fault.",
              "You have the power to change and make a positive impact on your life.",
              "There are various evidence-based treatments available for substance addiction, including behavioral therapies, medication-assisted treatment, and support groups.",
              "Your doctor or a mental health professional can help you find the right treatment for you.",
              "It's also important to take care of yourself and practice self-care, such as getting regular exercise, eating well, and getting enough sleep.",
              "Try to engage in activities that bring you joy and relaxation.",
              "Recovery is a journey and it won't happen overnight. It's okay to take one day at a time and celebrate the small wins along the way."
          ]
      },

      {   "tag": "antisocial personality",
          "keywords": [
              "I have trouble relating to others and understanding their emotions. Why is this and what can I do about it?",
              "I often engage in reckless or dangerous behavior and I don't seem to care about the consequences.",
              "I have a hard time following rules or laws and I feel like I'm always getting into trouble.",
              "How can I improve my behavior?",
              "I feel like I don't fit in with society",
              "How can I improve my social skills?",
              "I have a history of violence and aggression, and I'm worried that I'll hurt someone.",
              "What can I do to manage my anger and impulsiveness?",
              "I feel like I don't have any real goals or direction in life. What can I do to find purpose and fulfillment?"
          ],
          "responses": [
              "I understand that you may be experiencing challenges related to your antisocial personality disorder, and it can be difficult to navigate those challenges.",
              "It's important to remember that antisocial personality disorder is a treatable condition and with the right support, you can make positive changes in your life.",
              "Treatment options, such as psychotherapy and medication, can be effective in managing the symptoms of ASPD and helping you lead a more fulfilling life.",
              "It's also important to engage in self-care activities and develop healthy coping strategies, such as regular exercise, relaxation techniques, and spending time with supportive friends and family.",
              "Remember to be kind and compassionate to yourself. Change takes time, and progress is often made through small, consistent steps.",
              "It's also important to acknowledge and understand the impact that your behavior may have on others, and make a conscious effort to take steps to improve your relationships with those around you.",
              "Go take part in community service activities, you can make valuable connections there.",
              "Check out some of our routine activities!"
          ]
      },

      {   "tag": "eating",
          "keywords": [
              "I can't stop eating",
              "I'm getting fat",
              "I have a difficult time controlling my eating habits and I feel like I'm constantly obsessing about food and my weight.",
              "I'm afraid of gaining weight and I often engage in restrictive or binge-purge behaviors.",
              "How can I learn to have a healthier relationship with food?",
              "I feel ashamed and embarrassed about my eating disorder.",
              "I'm struggling to maintain a healthy weight.",
              "I feel like I've lost control over my eating and it's affecting every aspect of my life.",
              "I'm finding it difficult to stick to my meal plan."
          ],
          "responses": [
              "I understand that you may be experiencing challenges related to your eating disorder, and it can be difficult to navigate those challenges.",
              "It's important to remember that eating disorders are treatable conditions and with the right support, you can make positive changes in your life.",
              "Engage in self-care activities and develop healthy coping strategies. Try regular exercise, relaxation techniques, and spending time with supportive friends and family.",
              "Working with a mental health professional can help you better understand your thoughts and behaviors and provide you with strategies to manage and improve them.",
              "Remember to be kind and compassionate to yourself. Change takes time, and progress is often made through small, consistent steps.",
              "It's also important to seek support from loved ones, as having a strong support network can be an important factor in recovery from an eating disorder.",
              "Talk to people, explore your community, that will allow you to get help."
          ]
      },

      {   "tag": "trauma",
          "keywords": [
              "I feel overwhelmed by intense emotions and flashbacks",
              "I'm struggling to cope with a traumatic event.",
              "I'm struggling to maintain relationships.",
              "I'm constantly on edge and I can't shake the feeling that danger is lurking around me.",
              "How can I find peace and safety?",
              "I'm having trouble sleeping and I'm constantly worried about things.",
              "I feel like my trauma is impacting every aspect of my life and I'm not sure where to turn for help.",
              "I'm having difficulty trusting others."


          ],
          "responses": [
              "I understand that you may be struggling with a traumatic event and that it can be difficult to manage the intense emotions and memories associated with trauma.",
              "It's important to remember that you are not alone in your experiences and that many others have successfully worked through similar challenges.",
              "Know that treatments like cognitive behavioral therapy and eye movement desensitization and reprocessing (EMDR), can be effective in managing the symptoms of trauma.",
              "It's important to engage in self-care activities and develop healthy coping strategies, such as exercise, mindfulness, and spending time with supportive friends and family.",
              "Working with a mental health professional can provide you with the support and guidance you need.",
              "It's okay to take things one day at a time, and progress is often made through small, consistent steps.",
              "Remember to be kind and compassionate to yourself as you work through these challenges.",
              "Seeking support from loved ones and connecting with others who have gone through similar experiences can help.",
              "Know that you are loved!"
          ]
      },

      {   "tag": "hyperactivity adhd",
          "keywords": [
              "I'm having trouble focusing and staying on tasks.",
              "How can I manage my symptoms of ADHD?",
              "I feel like I'm constantly losing things and forget important details.",
              "Can you help me improve my memory and organization skills?",
              "I'm easily distracted and I have a hard time sitting still.",
              "How can I improve my concentration and focus?",
              "I'm finding it difficult to manage my time effectively and stay on track with responsibilities.",
              "Can you provide tips for time management and goal-setting?",
              "I'm feeling overwhelmed and stressed because of my symptoms.",
              "I feel like I have a lot of energy, but I'm not sure how to channel it in a productive way."
          ],
          "responses": [
              "I understand that ADHD can make it difficult to focus, concentrate, and manage time effectively.",
              "it's important to remember that you have many strengths and that ADHD is a treatable condition.",
              "You can try medication, behavioral therapy, and coaching, that can help manage the symptoms of ADHD.",
              "It can also be helpful to establish a routine and create a structured environment",
              "Working with a mental health professional can provide you with the support and guidance you need to better understand and manage your symptoms.",
              "Connecting with others who have similar experiences can be a source of support and encouragement.",
              "Remember to be kind and compassionate to yourself and celebrate your successes, no matter how small they may be."
          ]
      },

      {   "tag": "ugly",
          "keywords": [
              "I don't like the way I look and I feel like people judge me based on my appearance.",
              "What can I do to improve my self-esteem?",
              "I constantly compare myself to others and I feel like I don't measure up.",
              "How can I stop comparing and start appreciating myself?",
              "I feel like I'm not good enough and that my appearance is the reason why.",
              "How can I change the way I think about myself?",
              "I feel like I have low self-confidence and I don't know how to feel comfortable in my own skin.",
              "Can you help me build confidence?",
              "I feel like I've been struggling with negative thoughts about my appearance for a long time and I don't know how to overcome them.",
              "I think I'm clapped!"
          ],
          "responses": [
              "It's common to have negative thoughts about your appearance, but it's important to remember that beauty is subjective.",
              "I'm sure you have some unique qualities that make you special!",
              "Try focusing on your own strengths and qualities, and try to recognize the things that make you unique.",
              "It's normal to have insecurities, but it's important to challenge negative thoughts and practice self-compassion.",
              "Building self-confidence takes time and effort. You can try self-care, and mindfulness, that can help.",
              "Remember that you are more than your appearance and that your worth is not determined by how you look.",
              "Focus on the things that bring you joy and fulfillment, and don't be afraid to reach out for support from friends and family.",
              "Be kind and compassionate to yourself, and don't be too hard on yourself."
          ]
      }

  ]
}